sanhab-templates/registerCarDamagePayment-soapTemplate.txt

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:tem="http://tempuri.org/" xmlns:ns="http://schemas.datacontract.org/2004/07/">
   <soapenv:Header/>
   <soapenv:Body>
      <tem:RegWbsCarLos>
         <!--Optional:-->
         <tem:carLosReq>
            <!--Optional:-->
            <ns:CrtDte>${CrtDte}</ns:CrtDte>
            <!--Optional:-->
            <ns:EstLfAmnt>${EstLfAmnt}</ns:EstLfAmnt>
            <!--Optional:-->
            <ns:EvlLglId>${EvlLglId}</ns:EvlLglId>
            <!--Optional:-->
            <ns:EvlNtnlId>${EvlNtnlId}</ns:EvlNtnlId>
            <!--Optional:-->
            <ns:Exp>${Exp}</ns:Exp>
            <!--Optional:-->
            <ns:IsIrn>${IsIrn}</ns:IsIrn>
            <!--Optional:-->
            <ns:LfAmnt>${LfAmnt}</ns:LfAmnt>
            <!--Optional:-->
            <ns:PayAmnt>${PayAmnt}</ns:PayAmnt>
            <!--Optional:-->
            <ns:PayDte>${PayDte}</ns:PayDte>
            <!--Optional:-->
            <ns:PrntCmpDocNo>${PrntCmpDocNo}</ns:PrntCmpDocNo>
            <!--Optional:-->
            <ns:PrsnDocLosCmpDocNo>${PrsnDocLosCmpDocNo}</ns:PrsnDocLosCmpDocNo>
            <!--Optional:-->
            <ns:RcvAcntNo>${RcvAcntNo}</ns:RcvAcntNo>
            <!--Optional:-->
            <ns:RcvBrthdte>${RcvBrthdte}</ns:RcvBrthdte>
            <!--Optional:-->
            <ns:RcvLglId>${RcvLglId}</ns:RcvLglId>
            <!--Optional:-->
            <ns:RcvNam>${RcvNam}</ns:RcvNam>
            <!--Optional:-->
            <ns:RcvNtnlId>${RcvNtnlId}</ns:RcvNtnlId>
            <!--Optional:-->
            <ns:RcvTypCod>${RcvTypCod}</ns:RcvTypCod>
            <!--Optional:-->
            <ns:Rcy>${Rcy}</ns:Rcy>
            <!--Optional:-->
            <ns:ThrPayTypCod>${ThrPayTypCod}</ns:ThrPayTypCod>
            <!--Optional:-->
            <ns:ThrRcyTypCod>${ThrRcyTypCod}</ns:ThrRcyTypCod>
            <!--Optional:-->
            <ns:UnIrnCod>${UnIrnCod}</ns:UnIrnCod>
            <!--Optional:-->
            <ns:WbsCarDocLosPrsnUnqCod>${WbsCarDocLosPrsnUnqCod}</ns:WbsCarDocLosPrsnUnqCod>
            <!--Optional:-->
            <ns:WbsCarDocLosUnqCod>${WbsCarDocLosUnqCod}</ns:WbsCarDocLosUnqCod>
            <!--Optional:-->
            <ns:version>${version}</ns:version>
         </tem:carLosReq>
         <!--Optional:-->
         <tem:Username>${Username}</tem:Username>
         <!--Optional:-->
         <tem:PassWrod>${PassWrod}</tem:PassWrod>
      </tem:RegWbsCarLos>
   </soapenv:Body>
</soapenv:Envelope>